cf/InformationRegisters/ОтчетыОТестировании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ОтчетыОТестировании</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранимыйФайл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РезультатСогласования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументТестирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Обращение</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/ОтчетыОТестировании/Forms/ОтчетыПоИзменению/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОткрытьОтчет(Команда)
	
	КлючЗаписи = ЭтаФорма.Элементы.Список.ВыделенныеСтроки[0];
	СтруктураХранениеФайла = ПолучитьСтруктуруХраненияФайлаНаСервере(КлючЗаписи, УникальныйИдентификатор);
	
	Если СтруктураХранениеФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Прав(СтруктураХранениеФайла.Имя, 3) = "msg" Тогда
		ТекстВопроса = НСтр("ru = 'Этот файл является почтовым сообщением MS Outlook. В данной программе он не может быть открыт. Хотите получить почтовое сообщение с вложением этого файла на свою почту?'");
		ПараметрыОповещения = Новый Структура("СтруктураХранениеФайла, КлючЗаписи", СтруктураХранениеФайла, КлючЗаписи);
		Оповещение = Новый ОписаниеОповещения("ОбработкаВопроса", ЭтотОбъект, ПараметрыОповещения);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, НСтр("ru = 'Открытие файла'"));
		Возврат;
	КонецЕсли; 

	ПолучитьФайл(СтруктураХранениеФайла.Адрес, СтруктураХранениеФайла.Имя, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопроса(Знач Результат, Знач ПараметрКоманды) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	
	
	СтруктураХранениеФайла = ПараметрКоманды.СтруктураХранениеФайла;
	ДокументТестирования = ТИ.ПолучитьРеквизитПоСсылке(ПараметрКоманды.КлючЗаписи, "ДокументТестирования");
	
	СообщениеСтруктура = Новый Структура("ЗаголовокПисьма, ТекстПисьма", "Отправка:"+СтруктураХранениеФайла.Имя, "Сообщение содержит запрошенное вами письмо.");
	ФизЛицо = ТИ.ПолучитьРеквизитПоСсылке(ТИ.ТекущийПользователь(),"ФизЛицо");
	ТИ.СоздатьСообщение(ДокументТестирования, СообщениеСтруктура, ФизЛицо, ТИ.ПолучитьРеквизитПоСсылке(ФизЛицо, "АдресЭлектроннойПочты"), , СтруктураХранениеФайла.Имя, СтруктураХранениеФайла.Адрес);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруХраненияФайлаНаСервере(КлючЗаписи, УникальныйИдентификатор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетыОТестировании.ХранимыйФайл,
		|	ОтчетыОТестировании.Имя
		|ИЗ
		|	РегистрСведений.ОтчетыОТестировании КАК ОтчетыОТестировании
		|ГДЕ
		|	ОтчетыОТестировании.Задача = &Задача
		|	И ОтчетыОТестировании.ДокументТестирования = &ДокументТестирования
		|	И ОтчетыОТестировании.ТипОтчета = &ТипОтчета";
	
	Запрос.УстановитьПараметр("Задача", КлючЗаписи.Задача);
	Запрос.УстановитьПараметр("ДокументТестирования", КлючЗаписи.ДокументТестирования);
	Запрос.УстановитьПараметр("ТипОтчета", КлючЗаписи.ТипОтчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	СтруктураХранениеФайла = Неопределено;
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Адрес = ПоместитьВоВременноеХранилище(ВыборкаДетальныеЗаписи.ХранимыйФайл.Получить(), УникальныйИдентификатор);
		СтруктураХранениеФайла = Новый Структура("Адрес, Имя", Адрес, ВыборкаДетальныеЗаписи.Имя);
	КонецЕсли; 
	
	Возврат СтруктураХранениеФайла;
	
КонецФункции // ()
